[
    {
        "title": "Sharex JS DEV",
        "content": "<h2 class=\"text-2xl font-bold\">Sharex JS DEV</h2>\n                    <p>I would like to introduce you to this page. This page will give you all the information regarding the\n                        documentation on how to work with the API and how to set up for ShareX since it is so specific build\n                        for\n                        that usage.</p>\n\n                    <br/>\n\n                    <p>As it will be explained down below, this documentation is fully written for Windows users as ShareX\n                        hasn't come out with a stable version for MAC OS X yet.</p>\n\n                    <br/>\n\n                    <p>The menu for the documentation is on the right, please use that menu on the best quality. If you have\n                        any questions, feel free to let us know via support and we will give you an answer on that as soon\n                        as\n                        possible.</p>"
    },
    {
        "title": "Set-up domain",
        "content": "<h2 class=\"text-2xl font-bold\">Set-up domain</h2>\n                    <p>When you set up the domain, you need to make sure that you have the correct DNS settings for us. We\n                        recommend using Cloudflare as middleware to secure the connection.</p>\n                    <br/>\n                    <div class=\"inline-block\">When setting up the DNS setting, you need to make sure you use the IP\n                        <pre class=\"inline py-1 px-1 text-blue-main bg-white rounded\">167.86.123.2</pre>\n                        on the domain or\n                        the subdomain. If you do not need anything else besides the screenshots on that domain, it is\n                        suggested to just use the full domain under that IP.\n                    </div>\n                    <br/>\n                    <p>If that works correctly and the DNS lookup shows that name you can test it afterwards.</p>"
    },
    {
        "title": "Set-up Sharex with correct settings",
        "content": "<h2 class=\"text-2xl font-bold\">Set-up Sharex with correct settings</h2>\n                    <p>You can download ShareX at <a href=\"https://getsharex.com/downloads/\">getsharex.com/downloads</a>.\n                        Download the latest version. When you\n                        are installing Sharex, make sure you know the location where ShareX is located so whenever is needed\n                        you can find the screenshots.</p>\n                    <br/>\n\n                    <p>If you are knowledgeable on how to use ShareX, <a href=\"#sharex-settings\">Go directly to the settings</a>.</p>\n                    <br/>\n<!--\n ToDo: FIX Copy JSON format\n-->\n                    <p>If you do not want to know the application and just use the JSON format, click here to copy the json\n                        format so you can import it.</p>\n                    <br/>\n                    <p>After you have installed it, you want to the main window to pop-up. You do this by going in the\n                        location of the icon in the taskbar on the bottom-right and right-click on the ShareX icon and click\n                        \"main window\".</p>\n                    <br/>\n\n                    <p>When you have opened this screen, we want to set the custom uploader settings so that the appropriate\n                        information is set and it can be used.\n                        <br/>\n                        <br/>\n                        When you come in the custom uploader settings menu, you want to click 'new' on the uploading tab.\n                        Give it the name you want it to give so you can remember.</p>\n\n\n                    <h3 class=\"font-bold text-lg mt-3\" id=\"sharex-settings\">API/ShareX Settings</h3>\n                    <pre class=\"py-2 px-3 text-blue-main bg-white overflow-scroll md:overflow-auto rounded\">\nMethod: POST\nAPI URL: [domain]/api/v1/sharex/create\nBody: Form data (mulitpart/form-data)\n    email: your email\n    api_key: your API key you can find here.\nFile form name: sharex</pre>"
    }
]
